#!/bin/bash

# Запрос исходной и целевой директории у пользователя

# Запрос расширения файлов, которые нужно скопировать

# Запросить новое расширение для файлов.

# Проверка существования исходной директории и целевой директории


# Проверка, есть ли файлы с указанным расширением в исходной директории

# Копирование файлов с указанным расширением в целевую директорию

# Архивация данных

arcive_name="old_file_$(date +%Y%M%D).tar.gz"
tar -czf "$target_directory"/"$archive_name"  "$source_directory"/*."$file_extension"
