#!/bin/bash
# Запрос исходной и целевой директории у пользователя

# Запрос расширения файлов, которые нужно скопировать

#Запросить у пользователя новое расширения файлов.

read -p "Привет, введите новое расширение файлов (например .txt, .doc): " new_file_extension

echo "Вы ввели новое расширение файла: $new_file_extension"


# Проверка существования исходной директории и целевой директории


# Проверка, есть ли файлы с указанным расширением в исходной директории

# Копирование файлов с указанным расширением в целевую директорию

# Архивация исходных файлов.

